backend/controllers/CategoryController.php

INSERT INTO `category` (`name`, `description`, `color`) VALUES ('Desporto', 'desporto', '#000000')
---
    public function actionCreate()
    {
        $model = new Category();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `category` WHERE `category_id`='1'
---
    protected function findModel($category_id)
    {
        if (($model = Category::findOne(['category_id' => $category_id])) !== null) {