backend/controllers/UserController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $model_extra = Utilizador::Find()->where(['fk_user' => $id])->one();
---
SELECT * FROM `Utilizador` WHERE `fk_user`='2'