backend/controllers/WeeklyChallengeController.php

    public function actionCreate()
    {
        $model = new WeeklyChallenge();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `weekly_challenge` (`name`, `description`, `start_date`, `status`) VALUES ('test', 'tes', '2025-12-14', 1)

    protected function findModel($weekly_challenge_id)
    {
        if (($model = WeeklyChallenge::findOne(['weekly_challenge_id' => $weekly_challenge_id])) !== null) {
---
SELECT * FROM `weekly_challenge` WHERE `weekly_challenge_id`='1'