frontend/controllers/HabitController.php

    public function actionIndex()
    {
        $searchModel = new HabitSearch();
        //$dataProvider = $searchModel->search($this->request->queryParams);

        $user = Yii::$app->user->identity;
        $categories = \common\models\Category::find()->all();
---
SELECT * FROM `category`