backend/views/site/index.php

        <div class="col-12 col-sm-6 col-md-3">
            <?= \hail812\adminlte\widgets\InfoBox::widget([
                    'text' => 'Users:',
                    'number' => \common\models\User::find()->count(),
---
SELECT COUNT(*) FROM `user`

        <div class="col-12 col-sm-6 col-md-3">
            <?= \hail812\adminlte\widgets\InfoBox::widget([
                    'text' => 'Categories:',
                    'number' => \app\models\Category::find()->count(),
---
SELECT COUNT(*) FROM `category`